// ; Задача 19
// ; Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.
// ; 14212 -> нет
// ; 12821 -> да
// ; 23432 -> да




int number = System.Console.WriteLine("Ввведите 5-значное число:");
numberLength = number.ToString().Length;
// string[] array = numberLength;

// if (numberLenghth != 5)
// {
//     System.Console.WriteLine("Вы ввели не пятизначное число");
// }
// else
// {

// }

System.Console.WriteLine(numberLength);